Revit 2027 API
Element.RefersToExternalResourceReference Method
 Determines whether this Element uses external resources associated with a specified external resource type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RefersToExternalResourceReference(
	ExternalResourceType resourceType
)
Public Function RefersToExternalResourceReference (
	resourceType As ExternalResourceType
) As Boolean
public:
bool RefersToExternalResourceReference(
	ExternalResourceType^ resourceType
)
member RefersToExternalResourceReference :
        resourceType : ExternalResourceType -> bool
Parameters
resourceType ExternalResourceType
 The desired external resource type.
Return Value
Boolean
 Returns true if this Element uses external resources associated with the specified external resource type; otherwise, false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace